/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "Valeur invalide.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "La valeur “%@” est invalide.";

/* NSFormattingError */
"Err2048-C" = "Erreur de formatage.";

/* NSFileLockingError */
"Err255-C" = "Il est impossible de verrouiller le fichier.";

/* NSFileLockingError */
"Err255-R" = "Le fichier est peut-être déjà verrouillé, ou vous n’avez pas les autorisations d’accès suffisantes pour le verrouiller.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Il est impossible de verrouiller le fichier « %@ ».";

/* NSFileReadUnknownError */
"Err256" = "Il est impossible d’ouvrir le fichier.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Il est impossible d’ouvrir le fichier « %@ ».";

/* NSFileReadNoPermissionError */
"Err257" = "Le fichier n’a pu être ouvert car vous n’avez pas les autorisations d’accès suffisantes.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Vous ne possédez pas les autorisations d’accès suffisantes.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Pour afficher ou modifier vos autorisations d’accès, sélectionnez l’élément dans Finder puis choisissez Fichier > Lire les informations.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Le fichier “%@” n’a pu être ouvert car vous n’avez pas les autorisations d’accès suffisantes.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Nom de fichier invalide";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "L’élément n’a pu être ouvert car le nom de fichier « %@ » est invalide.";

/* NSFileReadCorruptFileError */
"Err259" = "Le fichier n’a pu être ouvert car il n’est pas au bon format.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Le fichier n’est pas au bon format.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Le fichier semble endommagé, incomplet, ou dans un format autre que celui attendu.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Le fichier « %@ » n’a pu être ouvert car il n’est pas au bon format.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Le fichier n’existe pas.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Le fichier « %@ » n’existe pas.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Le fichier n’a pu être ouvert avec l’encodage de texte spécifié.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "Le codage de texte spécifié n’est pas applicable.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Le codage de texte %@ ne peut être appliqué.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Il est possible que le fichier ait été enregistré avec un autre encodage de texte ou qu’il ne s’agisse pas d’un fichier texte.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Le fichier n’a pu être ouvert avec l’encodage de texte %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Le fichier « %2$@ » n’a pu être ouvert avec l’encodage de texte %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Le fichier n’a pu être ouvert car le type d’URL indiqué n’est pas reconnu.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Le type d’URL indiqué n’est pas reconnu.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Le fichier « %1$@ » n’a pu être ouvert car le type d’adresse URL %2$@ n’est pas pris en charge.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Le fichier n’a pu être ouvert car le type d’URL %@ n’est pas reconnu.";

/* NSFileReadTooLargeError */
"Err263" = "Le fichier n’a pu être ouvert car il est trop volumineux.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Le fichier est trop volumineux.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Le fichier « %@ » n’a pu être ouvert car il est trop volumineux.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Il est impossible d’ouvrir le fichier car l’encodage de texte du contenu n’a pas pu être déterminé.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "L’encodage de texte du contenu n’a pas pu être déterminé.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Il est peut-être possible d’ouvrir le fichier en spécifiant un encodage de texte précis.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Il est impossible d’ouvrir le fichier « %@ » car l’encodage de texte du contenu n’a pas pu être déterminé.";

/* NSUserCancelledError */
"Err3072-C" = "L’opération a été annulée.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "Il est impossible de supprimer « %@ ».";

/* NSFileNoSuchFileError */
"Err4-C" = "Le fichier n’existe pas.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Le fichier « %@ » n’existe pas.";

/* NSFileWriteUnknownError */
"Err512" = "Il est impossible d’enregistrer le fichier.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "« %1$@ » n’a pas pu être copié dans « %2$@ ».";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "« %1$@ » n’a pas pu être lié à « %2$@ ».";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "« %1$@ » n’a pas pu être déplacé dans « %2$@ ».";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "Il est impossible de supprimer « %@ ».";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Le fichier « %2$@ » n’a pu être enregistré dans le dossier « %1$@ ».";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Il est impossible d’enregistrement le fichier « %@ ».";

/* NSFileWriteNoPermissionError */
"Err513" = "Le fichier n’a pas pu être enregistré car vous ne possédez pas les autorisations d’accès suffisantes.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "« %1$@ » n’a pas pu être copié car vous ne possédez pas les autorisations d’accès suffisantes pour « %2$@ ».";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "« %1$@ » n’a pas pu être lié car vous ne possédez pas les autorisations d’accès suffisantes pour « %2$@ ».";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "« %1$@ » n’a pas pu être déplacé car vous ne possédez pas les autorisations d’accès suffisantes pour « %2$@ ».";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "« %@ » n’a pu être supprimé car vous ne possédez pas les autorisations d’accès suffisantes.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Vous ne possédez pas les autorisations d’accès suffisantes.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Pour afficher ou modifier vos autorisations d’accès, sélectionnez l’élément dans Finder puis choisissez Fichier > Lire les informations.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Vous ne possédez pas les autorisations d’accès suffisantes pour enregistrer le fichier “%2$@” dans le dossier “%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Vous ne possédez pas les autorisations d’accès suffisantes pour enregistrer le fichier “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "L’élément n’a pas pu être enregistré car le nom de fichier est invalide.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "L’élément n’a pu être supprimé car le nom de fichier « %@ » est invalide.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Nom de fichier invalide:";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "L’élément n’a pu être enregistré car le nom de fichier « %@ » est invalide.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Le fichier n’a pu être enregistré avec l’encodage de texte spécifié.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "Le codage de texte spécifié n’est pas applicable.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Le codage de texte %@ ne peut être appliqué.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Veuillez si possible choisir un autre codage de texte.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Le fichier n’a pu être enregistré avec l’encodage de texte %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Le fichier « %2$@ » n’a pu être enregistré avec l’encodage de texte %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Le fichier n’a pu être enregistré car le type d’URL indiqué n’est pas reconnu.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Le type d’URL indiqué n’est pas reconnu.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Le fichier « %1$@ » n’a pu être enregistré car le type d’adresse URL %2$@ n’est pas pris en charge.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Le fichier n’a pu être enregistré car le type d’URL %@ n’est pas reconnu.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Le fichier ne peut pas être enregistré car l’espace disponible est insuffisant.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "Il est impossible de copier « %1$@ » dans « %2$@ » car l’espace disponible est insuffisant.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "Il est impossible de lier « %1$@ » à « %2$@ » car l’espace disponible est insuffisant.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "Il est impossible de déplacer « %1$@ » dans « %2$@ » car l’espace disponible est insuffisant.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "L’espace est insuffisant.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "Le volume “%@” est saturé.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Veuillez supprimer quelques fichiers de ce volume puis réessayez.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Le fichier « %@ » ne peut pas être enregistré car l’espace disponible est insuffisant.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Le fichier “%1$@” ne peut être enregistré car le volume “%2$@” est saturé.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "L’opération n’a pas pu s’achever. (%1$@ erreur %2$ld)";

